# Electronics E-Commerce Domain Vocabulary
# Comprehensive vocabulary for typo correction in electronics shopping
# Format: one term per line, lowercase

# ===========================================
# MAJOR ELECTRONICS BRANDS
# ===========================================

# Smartphones & Mobile
apple
iphone
samsung
galaxy
google
pixel
oneplus
xiaomi
redmi
poco
huawei
honor
oppo
vivo
realme
motorola
moto
nokia
sony
xperia
lg
zte
alcatel
tcl
nothing
fairphone

# Laptops & Computers
dell
hp
hewlett
packard
lenovo
thinkpad
ideapad
legion
yoga
asus
vivobook
zenbook
rog
tuf
acer
aspire
predator
nitro
swift
msi
razer
alienware
microsoft
surface
apple
macbook
imac
mac
chromebook
framework
system76
tuxedo

# Computer Components
intel
amd
nvidia
geforce
radeon
ryzen
core
xeon
threadripper
epyc
celeron
pentium
athlon
rtx
gtx
quadro
tesla
arc
gigabyte
asrock
biostar
evga
zotac
pny
galax
inno3d
colorful
palit
gainward
sapphire
powercolor
xfx

# Storage
samsung
seagate
western
digital
wd
sandisk
crucial
kingston
toshiba
hitachi
hgst
transcend
adata
patriot
pny
lexar
verbatim
lacie
gtech

# Memory (RAM)
corsair
gskill
kingston
crucial
teamgroup
patriot
adata
hyperx
trident
vengeance
ripjaws
fury
ballistix
dominator

# Peripherals
logitech
razer
corsair
steelseries
hyperx
roccat
glorious
ducky
keychron
akko
varmilo
leopold
realforce
hhkb
topre
anne
pro
womier
gamakay
nuphy
keydous
epomaker
royal
kludge
rk
redragon
havit
pictek
victsing
anker
ugreen
baseus

# Audio
sony
bose
sennheiser
audio
technica
beyerdynamic
akg
shure
jabra
plantronics
jaybird
beats
airpods
galaxy
buds
jbl
harman
kardon
marshall
bang
olufsen
bowers
wilkins
klipsch
sonos
ultimate
ears
skullcandy
anker
soundcore
tribit
tozo
mpow
taotronics
edifier
audioengine
kef
focal
hifiman
audeze
grado
campfire
fiio
astell
kern
ibasso
shanling
cayin

# Monitors & Displays
lg
samsung
dell
asus
acer
benq
viewsonic
msi
gigabyte
aoc
philips
hp
lenovo
vizio
hisense
tcl
sony
panasonic
sharp
nec
eizo
iiyama
pixio
nixeus
eve
spectrum
dough

# TVs & Home Entertainment
lg
samsung
sony
panasonic
vizio
hisense
tcl
toshiba
sharp
philips
insignia
roku
amazon
fire
chromecast
apple
nvidia
shield

# Gaming Consoles
playstation
ps4
ps5
xbox
series
nintendo
switch
steam
deck
valve
oculus
quest
meta
htc
vive
psvr

# Cameras & Photography
canon
nikon
sony
fujifilm
panasonic
lumix
olympus
leica
hasselblad
phase
pentax
sigma
tamron
tokina
samyang
rokinon
zeiss
viltrox
godox
profoto
broncolor
elinchrom
neewer
yongnuo
flashpoint
manfrotto
gitzo
benro
peak
design
lowepro
think
tank

# Smart Home & IoT
amazon
alexa
echo
google
home
nest
apple
homekit
siri
samsung
smartthings
philips
hue
ring
blink
arlo
wyze
eufy
ecobee
honeywell
august
schlage
yale
simplisafe
abode
vivint
adt
lutron
caseta
wemo
tp
link
kasa
govee
nanoleaf
lifx
sengled
switchbot
shelly
tuya
zigbee
zwave

# Networking
netgear
asus
tp
link
linksys
ubiquiti
unifi
aruba
cisco
meraki
mikrotik
pfsense
synology
qnap
asustor
terramaster
buffalo
dlink
belkin
tenda
eero
orbi
deco
velop
amplifi

# Wearables & Fitness
apple
watch
samsung
galaxy
garmin
fitbit
polar
suunto
coros
amazfit
huawei
xiaomi
band
whoop
oura
withings
fossil
mobvoi
ticwatch

# ===========================================
# PRODUCT CATEGORIES
# ===========================================

# Devices
laptop
notebook
ultrabook
chromebook
desktop
workstation
server
tablet
smartphone
phone
cellphone
mobile
phablet
smartwatch
wearable
tracker
fitness
band
earbuds
headphones
headset
earphones
speaker
soundbar
subwoofer
amplifier
receiver
monitor
display
screen
television
projector
camera
webcam
microphone
keyboard
mouse
trackpad
touchpad
trackball
controller
gamepad
joystick
wheel
pedals
hotas
router
modem
gateway
switch
hub
access
point
extender
repeater
mesh
nas
enclosure
dock
docking
station
charger
powerbank
adapter
converter
cable
cord
connector

# Components
processor
cpu
chip
graphics
card
gpu
videocard
motherboard
mainboard
mobo
memory
ram
dimm
sodimm
storage
drive
hdd
ssd
nvme
sata
m2
pcie
expansion
riser
cooler
heatsink
fan
radiator
aio
watercooling
thermal
paste
case
chassis
tower
enclosure
psu
power
supply
ups
surge
protector

# ===========================================
# TECHNICAL SPECIFICATIONS
# ===========================================

# Storage Sizes
16gb
32gb
64gb
128gb
256gb
512gb
1tb
2tb
4tb
8tb
16tb

# RAM Sizes
4gb
8gb
16gb
32gb
64gb
128gb

# Screen Sizes
13
14
15
15.6
16
17
17.3
21
24
27
32
34
38
43
49
55
65
75
85

# Resolutions
720p
1080p
1440p
2160p
4k
5k
8k
hd
fhd
qhd
uhd
wqhd
uwqhd

# Refresh Rates
60hz
75hz
90hz
120hz
144hz
165hz
180hz
240hz
360hz

# Processor Specs
i3
i5
i7
i9
i5-12400
i5-13400
i5-14400
i7-12700
i7-13700
i7-14700
i9-12900
i9-13900
i9-14900
ryzen3
ryzen5
ryzen7
ryzen9
ryzen5-5600
ryzen7-5800
ryzen9-5900
ryzen5-7600
ryzen7-7800
ryzen9-7900
ryzen9-7950
m1
m2
m3
m1pro
m1max
m1ultra
m2pro
m2max
m2ultra
m3pro
m3max
snapdragon
exynos
dimensity
bionic
a14
a15
a16
a17

# Graphics Cards
rtx2060
rtx2070
rtx2080
rtx3050
rtx3060
rtx3070
rtx3080
rtx3090
rtx4060
rtx4070
rtx4080
rtx4090
rx6600
rx6700
rx6800
rx6900
rx7600
rx7700
rx7800
rx7900
gtx1050
gtx1060
gtx1070
gtx1080
gtx1650
gtx1660
arc770
arc750
arc380

# ===========================================
# EVERYDAY ENGLISH FOR SHOPPING
# ===========================================

# Search Intent Words
looking
searching
find
finding
need
needing
want
wanting
buy
buying
purchase
purchasing
get
getting
order
ordering
shop
shopping

# Price Related
cheap
cheaper
cheapest
affordable
budget
inexpensive
economical
value
expensive
premium
luxury
high
end
highend
flagship
mid
range
midrange
entry
level
entrylevel

# Comparison Words
best
better
top
rated
recommended
popular
trending
bestselling
reviewed
compared
versus
vs
alternative
similar
like

# Condition Words
new
used
refurbished
renewed
certified
open
box
openbox
sealed
factory
sealed
mint
condition
damaged
broken
defective

# Shopping Terms
deal
deals
sale
sales
discount
discounted
coupon
promo
promotion
clearance
outlet
warehouse
bundle
bundled
combo
package
set
kit
starter

# Shipping & Delivery
free
shipping
fast
delivery
express
overnight
same
day
next
prime
standard
ground
pickup
curbside
instore

# Colors (common for electronics)
black
white
silver
gold
rose
blue
red
green
gray
grey
space
midnight
starlight
alpine
purple
yellow
orange
pink
graphite
titanium
ceramic
matte
glossy

# ===========================================
# COMMON TYPOS -> CORRECT MAPPINGS
# ===========================================
# These are high-frequency typos specific to electronics

# Brand Typos (will be handled separately in typo_mappings.txt)
# iphone -> iphnoe, iphoen, iphne, ipone
# samsung -> samsng, samsnug, samsug, samsumg
# nvidia -> nvidai, nvidea, nividia, nvida
# lenovo -> lenvo, lenvoo, lennovo, lonovo
# etc.

# Common Word Typos in Searches
laptop
laptpp
laptp
lapto
latop
loptop
laptob

gaming
gameing
gamin
gamng
gaiming

wireless
wireles
wirelss
wirless
wirelees

bluetooth
bluethooth
bluetooh
blutooth
bluetoth

keyboard
keybord
keybaord
keyboad
kayboard

monitor
moniter
monitr
montor
mointor

headphones
headphons
headhones
hedphones
headfones

charger
chargr
chargar
chargeer
chrger

battery
baterry
battry
batery
batary

storage
stoarge
storge
storgae
stroage

memory
memry
memeory
memery
momory

graphics
graphcs
grafics
graphcis
grahpics

processor
processer
procesor
proccesor
processeor

display
dispaly
displya
disply
dysplay

screen
scren
screan
sceen
sreen

camera
camara
camra
cammera
cemara

speaker
speakr
speeker
speakre
speker

microphone
micorphone
micropohne
mircrophone
micrphone

adapter
adaptor
adaptar
adpater
adaptere

cable
cabel
cabl
cablee
cble

router
routr
roter
rouuter
routere

printer
printr
priner
prnter
printeer

scanner
scaner
scannar
scannr
scanneer
vram
rgb
